#+TITLE: Linux tips and tricks
#+STARTUP: showeverything
#+AUTHOR: Prutserdt

#+begin_example
          _     _                    _        _      _
         | |   (_)_ __  _   ___  __ | |_ _ __(_) ___| | _____ 
         | |   | | '_ \| | | \ \/ / | __| '__| |/ __| |/ / __|
         | |___| | | | | |_| ||  |  | |_| |  | | (__|   <\__ \
         |_____|_|_| |_|\__,_/_/\_\  \__|_|  |_|\___|_|\_\___/
                                          Created by Prutserdt
#+end_example

*** Batch rename image files

Imagemagick, simpel verkleinen, comprimeren en renamen van files in directory.
resize: pixel size, quality: compression, en daarachter naamverandering
#+begin_src shell
for f in *.JPG
  do
  echo "Converting $f."
  convert "$f" -resize 3000x2000 -quality 60% "${f/.JPG/-resized.JPG}"
done
#+end_src
Batch rename. Verander de naam van bestanden. Zet eerst de foto's in
directories met nummer van dag v.d. vakantie en locatie. Ga in de main 
directory. Dit scriptje VERPLAATST alleen bestanden uit de directory naar
de main directory met als begin de naam van de directory waar het in stond
#+begin_src shell
start=$PWD
for directory in *; do
  cd "$directory"
  for filename in *; do
mv "$filename" ../"$directory$filename"
  done
  cd "$start"
done
#+end_src
In command line:
~start=$PWD; for directory in *; do cd "$directory"; for filename in *; do mv "$filename" ../"$directory $filename"; done; cd "$start"; done~

Batch rename. Verander de naam van bestanden. Zet foto's in directories met nummer van 
dag v.d. vakantie en locatie. Ga in de main directory. Dit scriptje KOPIEERT alle 
bestanden uit de directory naar de main directory met als begin de naam van de 
directory waar het in stond.
PWD = print working directory

#+begin_src shell
start=$PWD
for directory in *; do
  cd "$directory"
  for filename in *; do
    cp "$filename" ../"$directory$filename"
  done
  cd "$start"
done
#+end_src

In command line:
~start=$PWD; for directory in *; do cd "$directory"; for filename in *; do cp "$filename" ../"$directory $filename"; done; cd "$start"; done~

rename all files in all directories....
#+begin_src shell
start=$PWD
for directory in *; do
  cd "$directory"
  for filename in *; do
 for i in $(ls *.*); do exiv2 -r '%Y%m%d-%H%M-:basename:' rename $i; done
  done
  cd "$start"
done
#+end_src

In command line:
#+begin_src shell
=start=$PWD; for directory in *; do cd "$directory"; for filename in *; do exiv2 -r'%Y%m%d_%H%M_:basename:' rename $(ls); done; cd "$start"; done=
=start=$PWD; for directory in *; do cd "$directory"; for filename in *; do exiv2 -r'%Y%m%d_:basename:' rename $(ls); done; cd "$start"; done=
#+end_src

#+begin_src shell
start=$PWD; for directory in *; do cd "$directory"; for filename in *; do for i in $(ls *.*); do for i in $(ls *.*); do exiv2 -r '%Y%m%d-%H%M-:basename:' rename $i; done; done; cd "$start"; done
#+end_src

werkt redelijk, maar niet super want de tijd wordt 3 keer herhaald (original+digitized+modified) Haakjes in naam werkt niet. .mov --> no exif data found in the file. 
~for i in $(ls *.*); do exiv2 -r '%Y%m%d-%H%M-:basename:' rename $i; done~

Find datum van foto metadata:
~identify -format %[EXIF:DateTimeOrginal]~
IMG_1923.JPG

Kopieer bestand in dezelfde directory met andere naam:
~cp IMG_1923.JPG test.JPG~

Vind datum van foto en gebruik dit voor het hernamen van de foto (test.jpg
--> 20150516-1935_test.jpg)
werkt goed. metadat blijft intact.
~exiv2 -r'%Y%m%d-%H%M_:basename:' rename $(ls)~

29MAR20: Rename pictures
Step 1, rename files by metadata in directory:
~exiv2 -r'%Y%m%d-%H%M_:basename:' rename $(ls)~
Step 2: Change *.jpeg to *.jpg in directory
~find -name '*.JPG' -exec rename .JPG .jpg {} \;~
~find -name '*.jpeg' -exec rename .jpeg .jpg {} \;~
Step 3: rename with location info
~rename 20190511 20190511_Schiphol *.jpg~

make a list:
#+begin_src shell
rename 20190511 20190511_Schiphol *.jpg
rename 20190512 20190512_Bangkok *.jpg
rename 20190513 20190513_Bangkok *.jpg
rename 20190514 20190514_Bangkok *.jpg
rename 20190515 20190515_Chiang_Mai *.jpg
rename 20190516 20190516_Chiang_Mai *.jpg
rename 20190517 20190517_Chiang_Mai *.jpg
rename 20190518 20190518_Chiang_Mai *.jpg
rename 20190519 20190519_Chiang_Mai *.jpg
rename 20190520 20190520_Koh_Yao_Noi *.jpg
rename 20190521 20190521_Koh_Yao_Noi *.jpg
rename 20190522 20190522_Koh_Yao_Noi *.jpg
rename 20190523 20190523_Kao_Sok *.jpg
rename 20190524 20190524_Kao_Sok *.jpg
rename 20190525 20190525_Kao_Sok *.jpg
rename 20190526 20190526_Koh_Tao *.jpg
rename 20190527 20190527_Koh_Tao *.jpg
rename 20190528 20190528_Koh_Tao *.jpg
rename 20190529 20190529_Koh_Samui *.jpg
rename 20190530 20190530_Ang_Thong *.jpg
rename 20190531 20190531_Koh_Samui *.jpg
rename 20190601 20190601_Bangkok *.jpg
rename 20190602 20190602_Schiphol *.jpg
rename 20190603 20190603_Schiphol *.jpg
#+end_src

Combine to one line:
#+begin_src shell
rename 20190511 20190511_Schiphol *.jpg; rename 20190512 20190512_Bangkok*.jpg; rename 20190513 20190513_Bangkok *.jpg; rename 20190514 20190514_Bangkok *.jpg; rename 20190515 20190515_Chiang_Mai *.jpg; rename 20190516 20190516_Chiang_Mai *.jpg; rename 20190517 20190517_Chiang_Mai *.jpg; rename 20190518 20190518_Chiang_Mai *.jpg; rename 20190519 20190519_Chiang_Mai *.jpg; rename 20190520 20190520_Koh_Yao_Noi *.jpg; rename 20190521 20190521_Koh_Yao_Noi *.jpg; rename 20190522 20190522_Koh_Yao_Noi *.jpg; rename 20190523 20190523_Kao_Sok *.jpg; rename 20190524 20190524_Kao_Sok *.jpg; rename 20190525 20190525_Kao_Sok *.jpg; rename 20190526 20190526_Koh_Tao *.jpg; rename 20190527 20190527_Koh_Tao *.jpg; rename 20190528 20190528_Koh_Tao *.jpg; rename 20190529 20190529_Koh_Samui *.jpg; rename 20190530 20190530_Ang_Thong *.jpg; rename 20190531 20190531_Koh_Samui *.jpg; rename 20190601 20190601_Bangkok *.jpg
#+end_src

Helaas lukte het niet om .mov .gif en .mp4 te hernoemen met de exiv2 data.
Daarom heb ik exiftool gedownload.
~exiftool -time:all VID_20190513_113545.mp4~
#+begin_example
Creation Date                   : 2019:06:01 14:09:27+07:00
gif: geen creation date 
mov: Creation Date
mp4: Creation Data
#+end_example

#+begin_example
exiftool -time:all IMG_4074.mov
Create Date                     : 2020:02:16 15:39:55
Creation Date                   : 2019:06:01 14:09:27+07:00
#+end_example
--------------------------------------------------------------
November 2020, wederom vakantiefotos sorteren.
Een van de devices lag 66 minuten achter. Daardoor werkte dit niet:
~exiv2 -r'%Y%m%d-%H%M_:basename:' rename $(ls)~
De fotos stonden daarna namelijk niet goed chronologisch. Dit is opgelost door 
de fotos van het device in een directory te zetten (pro tip: mount het geheugen
om extra snel te kunnen werken) en het volgende:
~exifftool -DateTimeOriginal+='0:00:0 1:06:0' *.*~
~rm *original~
en daarna alle foto's bij elkaar te zetten en in te voeren:
~exiv2 -r'%Y%m%d-%H%M_:basename:' rename $(ls)~  Nu wil ik nog de .jpeg en .JPG files omzetten naar .jpg.  Doe dit met:
~find -name '*.JPG' -exec rename .JPG .jpg {} \;~
~find -name '*.jpeg' -exec rename .jpeg .jpg {} \;~
Nu wil ik nog de locatie toevoegen voor elke foto.
Dat doen we per dag en daar zetten we een locatie bij.
Dat gaat handig via vim.
creer eerst een lijst met de dagen (kan ook via een script, zie shell script een eindje verder in dit document met daarin: ~for number in {0..18}=)~

#+begin_example
20201008
20201009
20201010
20201011
20201012
20201013
20201014
20201015
20201016
#+end_example

En verander dit in vim in de volgende lijst:
#+begin_src shell
rename 20201007 20201007_Roma *.jpg;
rename 20201008 20201008_Roma *.jpg;
rename 20201009 20201009_Roma *.jpg;
rename 20201010 20201010_Roma *.jpg;
rename 20201011 20201011_Napoli *.jpg;
rename 20201012 20201012_Napoli *.jpg;
rename 20201013 20201013_Napoli *.jpg;
rename 20201014 20201014_Napoli *.jpg;
rename 20201015 20201015_Positano *.jpg;
rename 20201016 20201016_Schiphol *.jpg;
#+end_src

#+begin_src shell
rename 20201007 20201007_Roma *.jpg; rename 20201008 20201008_Roma *.jpg; rename 20201009 20201009_Roma *.jpg; rename 20201010 20201010_Roma *.jpg; rename 20201011 20201011_Napoli *.jpg; rename 20201012 20201012_Napoli *.jpg; rename 20201013 20201013_Napoli *.jpg; rename 20201014 20201014_Napoli *.jpg; rename 20201015 20201015_Positano *.jpg; rename 20201016 20201016_Schiphol *.jpg;
#+end_src
En samenvoegen in vim tot de volgend commandline die je laat lopen
Opmerking: het gaf foutmeldingen, omdat het te snel gaat ofzo, onduidelijk, het
is wss beter om de bovenstaande commandos afzonderlijk te laten lopen, of er
een microbreak tussen zetten ofzo:
#+begin_src shell
rename 20201007 20201007_Roma *.jpg; rename 20201008 20201008_Roma *.jpg; rename 20201009 20201009_Roma *.jpg; rename 20201010 20201010_Roma *.jpg; rename 20201011 20201011_Napoli *.jpg; rename 20201012 20201012_Napoli *.jpg; rename 20201013 20201013_Napoli *.jpg; rename 20201014 20201014_Napoli *.jpg; rename 20201015 20201015_Positano *.jpg; rename 20201016 20201016_Schiphol *.jpg;
#+end_src
Mac image format heic conversion
Conversion of .heic to jpg:
~for file in *.heic; do heif-convert $file ${file/%.heic/.jpg}; done~

Roteren van afbeeldingen dmv exif informatie
Correct rotation image by exif data:
het volgende werkt NIET:
~jhead -autorot *.jpg~

andere optie: exiftran
WERKT OOK NIET:
~exiftran -ai *.jpg~
Geef exif informatie:
~identify -verbose 20201008_Roma-1022_IMG_6383.jpg | grep "exif:"""~
Informatie is te zien via:
~exiftool -Orientation -S IMG_0049.heic~
~exiftool -Orientation -S -n a IMG_0049.heic #(output als getal)~
WAT EEN GEDOE! DAN MAAR IN VIM VERWERKEN!!!!!!
Eerst orientatie zoeken via:
exiftool -Orientation -S *
Daarna deze output gecopieerd naar vim en de verschillende orientaties in
apparte dirs gezet (dmv commandline cp files.jpg file2.jpg dirnaam).
Daarna in deze dirs de bestanden gedraaid met de volgende commandos:

--------------------------------------------------------------
Augustus 2021: verwerken van fotos van Portugal vakantie. De apple fotos heb ik 
verkregen door de fotos te selecteren in apple photo en deze te plakken in een
mapje en deze te uploaden naar mijn cloud en ze binnen halen.
Ik heb dus de *.JPG en *.raw van mijn camera, de raw files zet ik appart en ga
ik niet aan zitten. Verder zijn er *.jpg van Cindy.
Eerst de volgende command line commandos uitgevoerd:
~mkdir test~
~cp *.* test~
~cd test~
~exiv2 -r'%Y%m%d-%H%M_:basename:' rename $(ls)~
~find -name '*.JPG' -exec rename .JPG .jpg {} \;~
~find -name '*.jpeg' -exec rename .jpeg .jpg {} \;~
Hier in vim de dagen van vakantie uitgetypt(volgend keer met het shell script dat onder het volgende example staat):

#+begin_example
20210615
20210616
20210617
20210618
20210619
20210620
20210621
20210622
20210623
20210624
20210625
20210626
20210627
20210628
20210629
20210630
20210701
20210702
20210703
#+end_example

Laat ik eens kijken of ik bovenstaande met org mode kan genereren via een shell script, dit werkt goed met :results output.

#+begin_src shell :results output
# Code block to calculate list of dates by this shell script in org mode.
# ONLY change two parts: number of days 18} and first day of holiday 15 Jun 2021, and press enter.
for number in {0..18}
do
date -d "15 Jun 2021 "${number}" days" +"%Y%m%d"
done
#+end_src

#+RESULTS:
#+begin_example
20210615
20210616
20210617
20210618
20210619
20210620
20210621
20210622
20210623
20210624
20210625
20210626
20210627
20210628
20210629
20210630
20210701
20210702
20210703
#+end_example


En vervolgens het adres er achter schrijven(via keyboard macros)
#+begin_example
20210615_Porto
20210616_Porto
20210617_Porto
20210619_Lagos
20210620_Lagos
20210621_Lagos
20210622_Lagos
20210623_Lagos
20210624_Lagos
20210625_Lagos
20210626_Evora
20210627_Evora
20210628_Evora
20210629_Pinhao
20210630_Pinhao
20210701_Pinhao
20210702_Pinhao
20210703_Amsterdam
#+end_example

Daarna het volgende ervoor/erachter zetten met macros keyboard en vim :
#+begin_src shell
rename 20210615 20210615_Porto *.jpg;
rename 20210616 20210616_Porto *.jpg;
rename 20210617 20210617_Porto *.jpg;
rename 20210619 20210619_Lagos *.jpg;
rename 20210620 20210620_Lagos *.jpg;
rename 20210621 20210621_Lagos *.jpg;
rename 20210622 20210622_Lagos *.jpg;
rename 20210623 20210623_Lagos *.jpg;
rename 20210624 20210624_Lagos *.jpg;
rename 20210625 20210625_Lagos *.jpg;
rename 20210626 20210626_Evora *.jpg;
rename 20210627 20210627_Evora *.jpg;
rename 20210628 20210628_Evora *.jpg;
rename 20210629 20210629_Pinhao *.jpg;
rename 20210630 20210630_Pinhao *.jpg;
rename 20210701 20210701_Pinhao *.jpg;
rename 20210702 20210702_Pinhao *.jpg;
rename 20210703 20210703_Amsterdam *.jpg;
#+end_src


Daarna het bovenstaande samengevoegd tot een enkel commando:
#+begin_src shell
rename 20210616 20210616_Porto *.jpg; rename 20210617 20210617_Porto *.jpg; rename 20210619 20210619_Lagos *.jpg; rename 20210620 20210620_Lagos *.jpg; rename 20210621 20210621_Lagos *.jpg; rename 20210622 20210622_Lagos *.jpg; rename 20210623 20210623_Lagos *.jpg; rename 20210624 20210624_Lagos *.jpg; rename 20210625 20210625_Lagos *.jpg; rename 20210626 20210626_Evora *.jpg; rename 20210627 20210627_Evora *.jpg; rename 20210628 20210628_Evora *.jpg; rename 20210629 20210629_Pinhao *.jpg; rename 20210630 20210630_Pinhao *.jpg; rename 20210701 20210701_Pinhao *.jpg; rename 20210702 20210702_Pinhao *.jpg; rename 20210703 20210703_Amsterdam *.jpg;
#+end_src

De *.mov files van apple moet ik nog hernoemen... Hoe kan ik in metadata...
onderstaande optie nog testen, volgens stackoverflow:
~exiftool -time:all vid.mov~

in de manpage staat het antwoord, alleen nog even checken of dit de juiste
format is....:

 exiftool '-FileName<CreateDate' -d %Y%m%d_%H%M%S%%-c.%%e dir
             Rename all images in "dir" according to the "CreateDate" date and
             time, adding a copy number with leading '-' if the file already
             exists("%-c"), and preserving the original file extension (%e).  Note the extra '%' necessary to escape the filename codes (%c and %e) in the date format string.)'')"")''""""'>'

